most-recent.org
# Created 2026-06-08 Mon 20:54
#+title: 2026-06-08 Emacs news
#+date: 2026-06-08T14:36:11-0400
#+author: Sacha Chua
It's [[https://rossabaker.com/blog/underappreciated-emacs-built-ins/][Emacs Built-ins appreciation month]]! I'm coming to appreciate the menu bar more. What built-ins do you appreciate? Write about it and [[https://rossabaker.com/blog/underappreciated-emacs-built-ins/][send Ross a link]]!

- Emacs updates:
  - [[https://lists.gnu.org/archive/html/emacs-devel/2026-06/msg00118.html][Emacs 31.0.90 pretest is available]] ([[https://www.reddit.com/r/emacs/comments/1tycwh7/emacs_31090_pretest_released_speed_boosts_ui/][Reddit]], [[https://www.linuxcompatible.org/story/emacs-31090-pretest-released-speed-boosts-ui-tweaks-bug-fixes/][Linux Compatible]], [[https://irreal.org/blog/?p=13858][Irreal]])
- Upcoming events ([[https://emacslife.com/calendar/emacs-calendar.ics][iCal file]], [[https://emacslife.com/calendar/][Org]]):
  - Emacs Berlin: In-Person-Only Emacs-Berlin Stammtisch https://emacs-berlin.org/ Tue Jun 9 1900 Europe/Berlin
  - OrgMeetup (virtual) https://orgmode.org/worg/orgmeetup.html Wed Jun 10 0900 America/Vancouver - 1100 America/Chicago - 1200 America/Toronto - 1600 Etc/GMT - 1800 Europe/Berlin - 2130 Asia/Kolkata -- Thu Jun 11 0000 Asia/Singapore
  - Atelier Emacs Montpellier (in person) https://lebib.org/date/atelier-emacs Fri Jun 12 1800 Europe/Paris
  - M-x Research: TBA https://m-x-research.github.io/ Wed Jun 17 0800 America/Vancouver - 1000 America/Chicago - 1100 America/Toronto - 1500 Etc/GMT - 1700 Europe/Berlin - 2030 Asia/Kolkata - 2300 Asia/Singapore
- Beginner:
  - [[https://www.youtube.com/watch?v=diPparUrHGw][How to Install Emacs on a Chromebook in 2026]] (07:15)
  - [[https://www.youtube.com/watch?v=CVtYtcFvutw][How to Setup Emacs on a Chromebook Without Elisp in 2026]] (10:37)
- Emacs configuration:
  - [[https://wiki.plexwave.org/useful-emacs-key-bindings][Useful Emacs key bindings]] ([[https://gts.plexwave.org/@spnw/statuses/01KT4TKGRQ2VZ62CD1N9APSG20][@spnw@plexwave.org]])
  - [[https://www.reddit.com/r/emacs/comments/1tzo8jz/this_is_my_best_emacs_function_written_in_my/][function to list bindings]]
  - [[https://ray-on-emacs.blogspot.com/2026/06/emacs-and-numeric-keypad.html][Raymond Zeitler: Emacs and the Numeric Keypad]]
  - [[https://mathstodon.xyz/@oantolin/116698855002229972][new embark-automatic-prefix-help-mode (@oantolin@mathstodon.xyz)]]
  - [[https://www.youtube.com/watch?v=ZCELm1zUcH0][How I structure my Emacs init.el file]] (27:05, [[https://github.com/maxfriis/my-emacs-config][GitHub]])
  - [[https://github.com/jamescherti/minimal-emacs.d][minimal-emacs.d: A Customizable init.el and early-init.el for Optimized Startup and Better Emacs Defaults [Release 1.5.0]​]] ([[https://www.reddit.com/r/emacs/comments/1tuowci/minimalemacsd_a_customizable_initel_and/][Reddit]])
  - [[https://github.com/scovl/dotfiles/tree/main/OpenBSD/.emacs.d][dotfiles/OpenBSD/.emacs.d at main · scovl/dotfiles · GitHub]] ([[https://hachyderm.io/@lobocode/116677349851718741][@lobocode@hachyderm.io]])
- Emacs Lisp:
  - [[https://github.com/k3jph/stops-el][k3jph/stops-el: stops: Guards in Emacs Lisp · GitHub]] ([[https://mastodon.social/@k3jph/116693120049548169][@k3jph]])
  - [[https://codeberg.org/imarko/vared.el][imarko/vared.el: Emacs command for interactively editing a variable - Codeberg.org]] ([[https://fosstodon.org/@zrzz/116711371610663138][@zrzz@fosstodon.org]])
- Appearance:
  - [[https://github.com/jamescherti/vim-tab-bar.el][vim-tab-bar: A Vim inspired Emacs tab-bar that adapts to any Emacs theme [Release 1.1.5]​]] ([[https://www.reddit.com/r/emacs/comments/1tu64xu/vimtabbar_a_vim_inspired_emacs_tabbar_that_adapts/][Reddit]])
  - [[https://www.chiply.dev/post-svg-line][svg-line: Better Status Bars for Emacs]] ([[https://www.reddit.com/r/emacs/comments/1u069gm/svgline_better_status_bars_for_emacs/][Reddit]], [[https://lobste.rs/s/bqjxzj/svg_line_better_status_bars_for_emacs][lobste.rs]])
  - [[https://ray-on-emacs.blogspot.com/2026/06/change-emacs-cursor-to-indicate.html][Raymond Zeitler: Change Emacs Cursor to Indicate Overwrite Mode]]
  - [[https://source.cipherbliss.com/tykayn/emacs-theming][tykayn/emacs-theming]] ([[https://mastodon.cipherbliss.com/@tykayn/116697952623553128][@tykayn@mastodon.cipherbliss.com]])
  - [[https://github.com/lucasobx/pixel-themes][Emacs themes inspired by pixel art palettes]] ([[https://www.reddit.com/r/emacs/comments/1tx56oj/emacs_themes_inspired_by_pixel_art_palettes/][Reddit]])
  - [[https://www.youtube.com/watch?v=FSdPbKTBWaQ][How to Change Themes in Emacs]] (01:31)
  - [[https://www.youtube.com/watch?v=7Gz-FOq9AIs][How to Inhibit the Welcome Screen in Emacs]] (01:12)
  - [[https://www.youtube.com/watch?v=Cr9IHzj_APQ][How to Maximize Emacs' Screen Upon Startup]] (01:24)
  - [[https://www.youtube.com/watch?v=Rsgg-uVJlIw][How to Hide the Tool Bar, Scroll Bar, and Menu Bar in Emacs]] (02:00)
  - [[https://www.youtube.com/watch?v=XTgIJUwmz0Q][Nicolas Rougier's Talk at 39C3 - The art of text (rendering)]] ([[https://www.reddit.com/r/emacs/comments/1txnsrr/nicolas_rougiers_talk_at_39c3_the_art_of_text/][Reddit]]) see discussion for more thoughts on SVG in Emacs
- Navigation:
  - [[https://www.reddit.com/r/emacs/comments/1tu9wvg/post_a_solution_embarkactonlastmessage/][Post a solution: embark-act-on-last-message]]
  - [[https://github.com/vmargb/project-x][Project-x revived with Emacs 30+ support!]] ([[https://www.reddit.com/r/emacs/comments/1tylkdz/projectx_revived_with_emacs_30_support/][Reddit]]) - session persistence
  - [[https://www.reddit.com/r/emacs/comments/1txrf6o/little_llm_helper_function_for_copying_fileline/][Little LLM helper function for copying file:line coordinates]]
  - [[https://github.com/jamescherti/kirigami.el][kirigami: A unified Emacs method to fold and unfold text in Emacs: outline, outline-indent, org-mode, markdown-mode, vdiff, hideshow, treesit-fold... [Release 1.1.2]​]] ([[https://www.reddit.com/r/emacs/comments/1tup3tb/kirigami_a_unified_emacs_method_to_fold_and/][Reddit]])
- Writing:
  - [[https://github.com/mmarshall540/electric-sentence][mmarshall540/electric-sentence: Automatically add the extra space between sentences in Emacs. · GitHub]] ([[https://www.reddit.com/r/emacs/comments/1tynlmb/wrote_a_package_to_add_the_2nd_space_between/][Reddit]])
  - [[https://github.com/jamescherti/quick-sdcv.el][quick-sdcv: Emacs offline dictionary using 'sdcv' [Release 1.0.5]​]] ([[https://www.reddit.com/r/emacs/comments/1tu6u91/quicksdcv_emacs_offline_dictionary_using_sdcv/][Reddit]], [[https://irreal.org/blog/?p=13848][Irreal]])
  - [[https://www.reddit.com/r/emacs/comments/1tvrwet/notes_linking_and_tagging_systems_in_emacs/][Notes, Linking and Tagging systems in Emacs]]
  - [[https://mahmoodsh.com/blk.html][blk]]: creating and navigating titles of text files, linking between them
  - [[https://blog.davep.org/2026/06/05/blogmore-el-v4-6-0.html][Dave Pearson: blogmore.el v4.6.0]] - show toc, show toc inline
- Org Mode:
  - [[https://bicycleforyourmind.com/much-ado-about-emacs-014][Much Ado About Emacs 014: Org-Mode and the Capture System]], creating headings at different levels, and changing bindings
  - [[https://taonaw.com/2026/06/03/correcting-photo-orientation-for-orgmode.html][TAONAW - Emacs and Org Mode: Correcting photo orientation for org-mode in Linux]] ([[https://irreal.org/blog/?p=13860][Irreal]])
  - [[https://citum.org/news/citing-with-citum-in-emacs-org-mode.html][Citing with Citum in Emacs org-mode | News | Citum]] ([[https://mas.to/@bdarcus/116677048360094778][@bdarcus@mas.to]])
  - [[https://eugene-andrienko.com/it/2024/12/01/emacs-plugin-jekyll-blog.html][How I wrote an Emacs plugin to build my blog]] ([[https://mastodon.bsd.cafe/@evgandr/116687815479622870][@evgandr@bsd.cafe]])
  - [[https://thecloudlet.github.io/technical/emacs/org-zola-workflow/][Migrating a Zola blog from Markdown to Org-mode — with a lint/export/check pipeline to keep them in sync | The Cloudlet]]
  - Org development: [[https://git.savannah.gnu.org/cgit/emacs/org-mode.git/commit/etc/ORG-NEWS?id=3ea1682731fa061115bc690e76ce7d1d2955f810][Generate images in TOC for HTML export]]
- Completion:
  - [[https://www.chiply.dev/post-incremental-suggesting-read][Beyond ICR: Incremental 'Suggesting' Read in Emacs]] ([[https://www.youtube.com/watch?v=UnAavHqekp0][YouTube]] 20:10, [[https://www.reddit.com/r/emacs/comments/1tvjp8l/beyond_icr_incremental_suggesting_read_in_emacs/][Reddit]], [[https://fosstodon.org/@chiply/116685381663629482][@chiply@fosstodon.org]])
- Coding:
  - [[https://github.com/rschmukler/magit-difftastic][Introducing magit-difftastic: integrate difftastic into magit]] ([[https://www.reddit.com/r/emacs/comments/1twq1bg/introducing_magitdifftastic_integrate_difftastic/][Reddit]])
  - [[https://github.com/phye/inline-review][inline-review: review merge/pull requests directly within emacs]] ([[https://www.reddit.com/r/emacs/comments/1ttw2qg/inlinereview_review_mergepull_requests_directly/][Reddit]])
  - [[https://www.alcarney.me/blog/2026/alc-jj-log-view-mode/][Building alc-jj-log-view-mode — Alex Carney]] ([[https://mastodon.social/@alcarney/116711382373829868][@alcarney]])
  - [[https://wassimans.com/blog/building-ios-apps-with-doom-emacs/][Building IOS Apps With Doom Emacs | Wassim Mansouri]] ([[https://news.ycombinator.com/item?id=48388710][HN]])
  - [[https://www.youtube.com/watch?v=thPsF9C2b10][CEDET for  Plan 9 coding]] (01:14)
  - [[https://oylenshpeegul.gitlab.io/blog/posts/20260601/][Tim Heaney: Ziglings]]
- Shells:
  - [[https://www.alcarney.me/blog/2026/eshell-integration/][A Simple jj Integration for eshell — Alex Carney]] ([[https://mastodon.social/@alcarney/116703207672988666][@alcarney]])
  - [[https://ray-on-emacs.blogspot.com/2026/06/exeln-execute-line.html][Raymond Zeitler: exeln: EXEcute LiNe]]
    - [[https://ray-on-emacs.blogspot.com/2026/06/follow-on-to-exeln.html][Follow-on to exeln]]
- Web:
  - [[https://irreal.org/blog/?p=13846][Irreal: My Growing Appreciation For EWW]]
- Mail, news, and chat:
  - [[https://ashishpanigrahi.com/blog/o365-offline-email/][Setting up offline email for Microsoft O365 with notmuch and emacs | Ashish Panigrahi]] ([[https://ioc.exchange/@paniash/116711092886642906][@paniash@ioc.exchange]])
  - [[https://lars.ingebrigtsen.no/2026/06/05/super-simple-spam-splitting-for-gnus/][Lars Ingebrigtsen: Super Simple Spam Splitting for Gnus]]
  - [[https://github.com/emacs-elfeed/elfeed/blob/main/NEWS.org#version-400-2026-06-06][New Elfeed 4.0.0 release]] ([[https://irreal.org/blog/?p=13862][Irreal]], [[https://news.ycombinator.com/item?id=48428652][HN]])
  - [[https://en.andros.dev/blog/1a6f3018/chatting-via-meshtastic-in-emacs/][Chatting via Meshtastic in Emacs | Andros Fenollosa]]
- Multimedia:
  - [[https://mbork.pl/2026-06-06_Copying_images_in_Emacs][Marcin Borkowski: Copying images in Emacs]]
  - [[https://www.youtube.com/watch?v=iUrTC4PrBpM][Kokoro-onnx with Cuda for text to speech with Emacs]] (01:26:56)
- Fun:
  - [[https://github.com/modeverv/wasmacs][I ported GNU Emacs 30.2 to the browser with WebAssembly]] ([[https://www.reddit.com/r/emacs/comments/1tzy72g/i_ported_gnu_emacs_302_to_the_browser_with/][Reddit]])
  - [[https://ianyepan.github.io/posts/emacs-in-pop-culture/][Emacs Appearance in Pop Culture]] ([[https://www.reddit.com/r/emacs/comments/1u02d0v/emacs_appearance_in_pop_culture/][Reddit]])
- AI:
  - [[https://kevinlynagh.com/newsletter/2026_05_difftron/][Structural diffing in Emacs; deterministic agent harnesses]] ([[https://github.com/lynaghk/difftron/][GitHub]])
  - [[https://github.com/ananthakumaran/pi.el][Emacs client for Pi Coding Agent]] ([[https://www.reddit.com/r/emacs/comments/1tz40nr/emacs_client_for_pi_coding_agent/][Reddit]])
  - [[https://github.com/jaketothepast/codetutor][jaketothepast/codetutor: An AI Pair Programmer, that teaches you to code as you write, for Emacs · GitHub]] ([[https://news.ycombinator.com/item?id=48449430][HN]])
- Community:
  - [[https://www.reddit.com/r/emacs/comments/1tueedh/fortnightly_tips_tricks_and_questions_20260602/][Fortnightly Tips, Tricks, and Questions — 2026-06-02 / week 22]]
  - [[https://www.reddit.com/r/emacs/comments/1tudad3/learning_emacs_with_progressive_vision_loss/][Learning Emacs with Progressive Vision Loss]]
  - [[https://kelar.org/~bandali/news/fsa-202605.html][Amin Bandali: Free software activities in May 2026]]
  - [[https://sachachua.com/blog/2026/06/june-4-emacs-chat-with-ben-zanin-gnomon-mastodon-social/][Emacs Chat 25: Ben Zanin (@gnomon@mastodon.social)]] ([[https://www.youtube.com/watch?v=ax4f5uaOHA8][YouTube]] 59:30)
  - [[https://sachachua.com/blog/2026/05/emacs-carnival-may-2026-may-i-recommend/][Sacha Chua: Emacs Carnival May 2026 wrap-up: "May I recommend..."]]
  - [[https://sachachua.com/blog/2026/06/transcript-of-chat-with-matei-candea-about-emacs-and-ai/][Sacha Chua: Transcript of chat with Matei Candea about Emacs and AI]]
  - [[https://www.youtube.com/watch?v=UqashZncNj4][This perfect text editor doesn't exist]] (15:57)
  - [[https://linuxblog.io/teco-neovim-text-editing-unix-linux/][From TECO to Neovim: 50 Years of Text Editing on Unix and Linux]] ([[https://www.reddit.com/r/emacs/comments/1tzo58i/from_teco_to_neovim_50_years_of_text_editing_on/][Reddit]])
  - [[https://www.swi-prolog.org/PceEmacs.md][PceEmacs is an Emacs written in Prolog instead of Lisp! It also seems to support LSP]] ([[https://www.reddit.com/r/emacs/comments/1tvn264/pceemacs_is_an_emacs_written_in_prolog_instead_of/][Reddit]])
- [[https://rossabaker.com/blog/underappreciated-emacs-built-ins/][Emacs Carnival: Underappreciated Emacs Builtins]]:
  - [[https://www.homepages.ucl.ac.uk/~ucecesf/blog/20260602.html][Emacs carnival: rec mode, an all-text database system]] ([[https://fediscience.org/@ericsfraga/116681034174534204][@ericsfraga@fediscience.org]])
  - [[https://www.cyan.sh/blog/posts/radical-builtins.html][Jakub Nowak: Radical Builtins]]
  - [[https://wiki.plexwave.org/emacs-dwim-case-commands][Emacs DWIM case commands]] by spnw
- Other:
  - [[https://github.com/ErikPrantare/phony.el][phony.el: Define voice commands in Emacs]] ([[https://www.reddit.com/r/emacs/comments/1tubei6/phonyel_define_voice_commands_in_emacs/][Reddit]])
  - [[https://bicycleforyourmind.com/much_ado_about_emacs_013][Bicycle for Your Mind: Much Ado About Emacs 013]] - anddo.el (todos), substitute
  - [[https://lars.ingebrigtsen.no/2026/06/03/todo-lists-and-procrastination/][Lars Ingebrigtsen: Todo Lists and Procrastination]]
  - [[https://github.com/jamescherti/inhibit-mouse.el][jamescherti/inhibit-mouse.el 1.0.4]] ([[https://www.reddit.com/r/emacs/comments/1tvwk7l/inhibitmouse_disable_the_mouse_in_emacs_release/][Reddit]], [[https://irreal.org/blog/?p=13853][Irreal]])
  - [[http://yummymelon.com/devnull/revisiting-emacs-keyboard-macros-with-a-mouse.html][Charles Choi: Revisiting Emacs Keyboard Macros with a Mouse]]
  - [[https://sachachua.com/blog/2026/06/emacs-pdf-view-replace-current-page-with-file-using-pdftk/][Sacha Chua: Emacs PDF View: Replace current page with file using PDFtk]]
  - [[https://www.yakshaving.co.uk/posts/conquering-the-emacs-daemon/][conquering the Emacs daemon - Blog In Isolation]] ([[https://mastodon.me.uk/@andyc/116697585241088161][@andyc@mastodon.me.uk]])
  - [[https://github.com/tanrax/emacs-gpu][tanrax/emacs-gpu: GNU Emacs with a GPU-accelerated display backend · GitHub]] ([[https://activity.andros.dev/@andros/statuses/01KT8T7D12K9A22FCZX0NXDV43][@andros@activity.andros.dev]])
    - [[https://yhetil.org/emacs-devel/0CAC2512-C560-4D1C-964B-46BBEF5228BF@subvertising.org/][emacs-devel re: overlap with Canvas patch]],[[https://yhetil.org/emacs-devel/571c261a-a4fc-4d7f-9ccb-afc6cb530547@gutov.dev/][ can't accept LLM-generated contributions]]
  - [[https://fedora-sysexts.github.io/fedora/emacs/][emacs | extensions.fcos.fr (Fedora)]] ([[https://mastodon.social/@alcarney/116687391476450331][@alcarney]]) - emacs sysext for Fedora image-based systems
  - [[https://github.com/nohzafk/emacs-workspace-hud][I built a floating HUD for Emacs, rendered in Rust egui via WASM]] ([[https://www.reddit.com/r/emacs/comments/1tw7u87/i_built_a_floating_hud_for_emacs_rendered_in_rust/][Reddit]]) macOS
  - [[http://yummymelon.com/devnull/opening-macos-finder-folders-in-emacs-with-scrim.html][Charles Choi: Opening macOS Finder Folders in Emacs with Scrim]] ([[https://sfba.social/@kickingvegas/116678063857985054][@kickingvegas@sfba.social]])
  - [[https://unixbhaskar.wordpress.com/2026/06/03/damn-emacs-regex-problem/][Damn! Emacs Regex problem | Unixbhaskar's Blog]] ([[https://fosstodon.org/@unixbhaskar/116682966197832720][@unixbhaskar@fosstodon.org]])
  - [[https://www.youtube.com/watch?v=omoGBS3rzEw][самый хайповый гайд на Emacs]] (15:40)
- Emacs development:
  - emacs-devel: [[https://yhetil.org/emacs-devel/m2mrxes3bs.fsf@gmail.com/][markdown-ts-mode and markdown-ts-view-mode demoted on the release branch]]
  - [[https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=1d91d9b717df1781c07d28f46af4ac2af19c16b4][project-vc-dir: Use truenames]]
  - [[https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=66e02b3123a2f6845b1ec6e192f3820bb74d4a7b][(Fmarkers_in): New function (bug#81153)]]
  - [[https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=2db5a145acbbe84042128806d8b2e333495cf70e][Support Ansible messages in compilation-mode]]
- New packages:
  - https://melpa.org/#/bluesky: A Bluesky client (MELPA)
  - https://melpa.org/#/cui: AI-LLM chat blocks for org-mode (MELPA)
  - https://melpa.org/#/desert-theme: A warm earthy port of Vim's desert theme (MELPA)
  - https://elpa.nongnu.org/nongnu/flamegraph.html: Flame graphs for Emacs's native profiler and folded stacks files (NonGNU ELPA)
  - https://melpa.org/#/sleek-modeline: Minimal and elegant modeline (MELPA)

Links from [[https://www.reddit.com/r/emacs][reddit.com/r/emacs]], [[https://www.reddit.com/r/orgmode][r/orgmode]], [[https://www.reddit.com/r/spacemacs][r/spacemacs]], [[https://mastodon.social/tags/emacs][Mastodon #emacs]], [[https://bsky.app/hashtag/emacs][Bluesky #emacs]], [[https://hn.algolia.com/?query=emacs&sort=byDate&prefix&page=0&dateRange=all&type=story][Hacker News]], [[https://lobste.rs/search?q=emacs&what=stories&order=newest][lobste.rs]], [[https://programming.dev/c/emacs?dataType=Post&page=1&sort=New][programming.dev]], [[https://lemmy.world/c/emacs][lemmy.world]], [[https://lemmy.ml/c/emacs?dataType=Post&page=1&sort=New][lemmy.ml]], [[https://planet.emacslife.com][planet.emacslife.com]], [[https://www.youtube.com/playlist?list=PL4th0AZixyREOtvxDpdxC9oMuX7Ar7Sdt][YouTube]], [[http://git.savannah.gnu.org/cgit/emacs.git/log/etc/NEWS][the Emacs NEWS file]], [[https://emacslife.com/calendar/][Emacs Calendar]], and [[https://lists.gnu.org/archive/html/emacs-devel/2026-06][emacs-devel]]. Thanks to Andrés Ramírez for emacs-devel links. Do you have an Emacs-related link or announcement? Please e-mail me at [[mailto:sacha@sachachua.com][sacha@sachachua.com]]. Thank you!
