most-recent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-08 Mon 20:54 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2026-06-08 Emacs news</title>
<meta name="author" content="Sacha Chua" />
<meta name="generator" content="Org Mode" />

       <link rel="stylesheet" type="text/css" href="https://sachachua.com/assets/css/style.css"></link>
       <link rel="stylesheet" type="text/css" href="https://sachachua.com/assets/css/org-export.css"></link>
</head>
<body>
<div id="preamble" class="status">
<a name="top" id="top"></a>
</div>
<div id="content" class="content">
<header>
<h1 class="title">2026-06-08 Emacs news</h1>
</header><p>
It's <a href="https://rossabaker.com/blog/underappreciated-emacs-built-ins/">Emacs Built-ins appreciation month</a>! I'm coming to appreciate the menu bar more. What built-ins do you appreciate? Write about it and <a href="https://rossabaker.com/blog/underappreciated-emacs-built-ins/">send Ross a link</a>!
</p>

<ul class="org-ul">
<li>Emacs updates:
<ul class="org-ul">
<li><a href="https://lists.gnu.org/archive/html/emacs-devel/2026-06/msg00118.html">Emacs 31.0.90 pretest is available</a> (<a href="https://www.reddit.com/r/emacs/comments/1tycwh7/emacs_31090_pretest_released_speed_boosts_ui/">Reddit</a>, <a href="https://www.linuxcompatible.org/story/emacs-31090-pretest-released-speed-boosts-ui-tweaks-bug-fixes/">Linux Compatible</a>, <a href="https://irreal.org/blog/?p=13858">Irreal</a>)</li>
</ul></li>
<li>Upcoming events (<a href="https://emacslife.com/calendar/emacs-calendar.ics">iCal file</a>, <a href="https://emacslife.com/calendar/">Org</a>):
<ul class="org-ul">
<li>Emacs Berlin: In-Person-Only Emacs-Berlin Stammtisch <a href="https://emacs-berlin.org/">https://emacs-berlin.org/</a> Tue Jun 9 1900 Europe/Berlin</li>
<li>OrgMeetup (virtual) <a href="https://orgmode.org/worg/orgmeetup.html">https://orgmode.org/worg/orgmeetup.html</a> Wed Jun 10 0900 America/Vancouver - 1100 America/Chicago - 1200 America/Toronto - 1600 Etc/GMT - 1800 Europe/Berlin - 2130 Asia/Kolkata &ndash; Thu Jun 11 0000 Asia/Singapore</li>
<li>Atelier Emacs Montpellier (in person) <a href="https://lebib.org/date/atelier-emacs">https://lebib.org/date/atelier-emacs</a> Fri Jun 12 1800 Europe/Paris</li>
<li>M-x Research: TBA <a href="https://m-x-research.github.io/">https://m-x-research.github.io/</a> Wed Jun 17 0800 America/Vancouver - 1000 America/Chicago - 1100 America/Toronto - 1500 Etc/GMT - 1700 Europe/Berlin - 2030 Asia/Kolkata - 2300 Asia/Singapore</li>
</ul></li>
<li>Beginner:
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=diPparUrHGw">How to Install Emacs on a Chromebook in 2026</a> (07:15)</li>
<li><a href="https://www.youtube.com/watch?v=CVtYtcFvutw">How to Setup Emacs on a Chromebook Without Elisp in 2026</a> (10:37)</li>
</ul></li>
<li>Emacs configuration:
<ul class="org-ul">
<li><a href="https://wiki.plexwave.org/useful-emacs-key-bindings">Useful Emacs key bindings</a> (<a href="https://gts.plexwave.org/@spnw/statuses/01KT4TKGRQ2VZ62CD1N9APSG20">@spnw@plexwave.org</a>)</li>
<li><a href="https://www.reddit.com/r/emacs/comments/1tzo8jz/this_is_my_best_emacs_function_written_in_my/">function to list bindings</a></li>
<li><a href="https://ray-on-emacs.blogspot.com/2026/06/emacs-and-numeric-keypad.html">Raymond Zeitler: Emacs and the Numeric Keypad</a></li>
<li><a href="https://mathstodon.xyz/@oantolin/116698855002229972">new embark-automatic-prefix-help-mode (@oantolin@mathstodon.xyz)</a></li>
<li><a href="https://www.youtube.com/watch?v=ZCELm1zUcH0">How I structure my Emacs init.el file</a> (27:05, <a href="https://github.com/maxfriis/my-emacs-config">GitHub</a>)</li>
<li><a href="https://github.com/jamescherti/minimal-emacs.d">minimal-emacs.d: A Customizable init.el and early-init.el for Optimized Startup and Better Emacs Defaults [Release 1.5.0]​</a> (<a href="https://www.reddit.com/r/emacs/comments/1tuowci/minimalemacsd_a_customizable_initel_and/">Reddit</a>)</li>
<li><a href="https://github.com/scovl/dotfiles/tree/main/OpenBSD/.emacs.d">dotfiles/OpenBSD/.emacs.d at main · scovl/dotfiles · GitHub</a> (<a href="https://hachyderm.io/@lobocode/116677349851718741">@lobocode@hachyderm.io</a>)</li>
</ul></li>
<li>Emacs Lisp:
<ul class="org-ul">
<li><a href="https://github.com/k3jph/stops-el">k3jph/stops-el: stops: Guards in Emacs Lisp · GitHub</a> (<a href="https://mastodon.social/@k3jph/116693120049548169">@k3jph</a>)</li>
<li><a href="https://codeberg.org/imarko/vared.el">imarko/vared.el: Emacs command for interactively editing a variable - Codeberg.org</a> (<a href="https://fosstodon.org/@zrzz/116711371610663138">@zrzz@fosstodon.org</a>)</li>
</ul></li>
<li>Appearance:
<ul class="org-ul">
<li><a href="https://github.com/jamescherti/vim-tab-bar.el">vim-tab-bar: A Vim inspired Emacs tab-bar that adapts to any Emacs theme [Release 1.1.5]​</a> (<a href="https://www.reddit.com/r/emacs/comments/1tu64xu/vimtabbar_a_vim_inspired_emacs_tabbar_that_adapts/">Reddit</a>)</li>
<li><a href="https://www.chiply.dev/post-svg-line">svg-line: Better Status Bars for Emacs</a> (<a href="https://www.reddit.com/r/emacs/comments/1u069gm/svgline_better_status_bars_for_emacs/">Reddit</a>, <a href="https://lobste.rs/s/bqjxzj/svg_line_better_status_bars_for_emacs">lobste.rs</a>)</li>
<li><a href="https://ray-on-emacs.blogspot.com/2026/06/change-emacs-cursor-to-indicate.html">Raymond Zeitler: Change Emacs Cursor to Indicate Overwrite Mode</a></li>
<li><a href="https://source.cipherbliss.com/tykayn/emacs-theming">tykayn/emacs-theming</a> (<a href="https://mastodon.cipherbliss.com/@tykayn/116697952623553128">@tykayn@mastodon.cipherbliss.com</a>)</li>
<li><a href="https://github.com/lucasobx/pixel-themes">Emacs themes inspired by pixel art palettes</a> (<a href="https://www.reddit.com/r/emacs/comments/1tx56oj/emacs_themes_inspired_by_pixel_art_palettes/">Reddit</a>)</li>
<li><a href="https://www.youtube.com/watch?v=FSdPbKTBWaQ">How to Change Themes in Emacs</a> (01:31)</li>
<li><a href="https://www.youtube.com/watch?v=7Gz-FOq9AIs">How to Inhibit the Welcome Screen in Emacs</a> (01:12)</li>
<li><a href="https://www.youtube.com/watch?v=Cr9IHzj_APQ">How to Maximize Emacs' Screen Upon Startup</a> (01:24)</li>
<li><a href="https://www.youtube.com/watch?v=Rsgg-uVJlIw">How to Hide the Tool Bar, Scroll Bar, and Menu Bar in Emacs</a> (02:00)</li>
<li><a href="https://www.youtube.com/watch?v=XTgIJUwmz0Q">Nicolas Rougier's Talk at 39C3 - The art of text (rendering)</a> (<a href="https://www.reddit.com/r/emacs/comments/1txnsrr/nicolas_rougiers_talk_at_39c3_the_art_of_text/">Reddit</a>) see discussion for more thoughts on SVG in Emacs</li>
</ul></li>
<li>Navigation:
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/emacs/comments/1tu9wvg/post_a_solution_embarkactonlastmessage/">Post a solution: embark-act-on-last-message</a></li>
<li><a href="https://github.com/vmargb/project-x">Project-x revived with Emacs 30+ support!</a> (<a href="https://www.reddit.com/r/emacs/comments/1tylkdz/projectx_revived_with_emacs_30_support/">Reddit</a>) - session persistence</li>
<li><a href="https://www.reddit.com/r/emacs/comments/1txrf6o/little_llm_helper_function_for_copying_fileline/">Little LLM helper function for copying file:line coordinates</a></li>
<li><a href="https://github.com/jamescherti/kirigami.el">kirigami: A unified Emacs method to fold and unfold text in Emacs: outline, outline-indent, org-mode, markdown-mode, vdiff, hideshow, treesit-fold&hellip; [Release 1.1.2]​</a> (<a href="https://www.reddit.com/r/emacs/comments/1tup3tb/kirigami_a_unified_emacs_method_to_fold_and/">Reddit</a>)</li>
</ul></li>
<li>Writing:
<ul class="org-ul">
<li><a href="https://github.com/mmarshall540/electric-sentence">mmarshall540/electric-sentence: Automatically add the extra space between sentences in Emacs. · GitHub</a> (<a href="https://www.reddit.com/r/emacs/comments/1tynlmb/wrote_a_package_to_add_the_2nd_space_between/">Reddit</a>)</li>
<li><a href="https://github.com/jamescherti/quick-sdcv.el">quick-sdcv: Emacs offline dictionary using 'sdcv' [Release 1.0.5]​</a> (<a href="https://www.reddit.com/r/emacs/comments/1tu6u91/quicksdcv_emacs_offline_dictionary_using_sdcv/">Reddit</a>, <a href="https://irreal.org/blog/?p=13848">Irreal</a>)</li>
<li><a href="https://www.reddit.com/r/emacs/comments/1tvrwet/notes_linking_and_tagging_systems_in_emacs/">Notes, Linking and Tagging systems in Emacs</a></li>
<li><a href="https://mahmoodsh.com/blk.html">blk</a>: creating and navigating titles of text files, linking between them</li>
<li><a href="https://blog.davep.org/2026/06/05/blogmore-el-v4-6-0.html">Dave Pearson: blogmore.el v4.6.0</a> - show toc, show toc inline</li>
</ul></li>
<li>Org Mode:
<ul class="org-ul">
<li><a href="https://bicycleforyourmind.com/much-ado-about-emacs-014">Much Ado About Emacs 014: Org-Mode and the Capture System</a>, creating headings at different levels, and changing bindings</li>
<li><a href="https://taonaw.com/2026/06/03/correcting-photo-orientation-for-orgmode.html">TAONAW - Emacs and Org Mode: Correcting photo orientation for org-mode in Linux</a> (<a href="https://irreal.org/blog/?p=13860">Irreal</a>)</li>
<li><a href="https://citum.org/news/citing-with-citum-in-emacs-org-mode.html">Citing with Citum in Emacs org-mode | News | Citum</a> (<a href="https://mas.to/@bdarcus/116677048360094778">@bdarcus@mas.to</a>)</li>
<li><a href="https://eugene-andrienko.com/it/2024/12/01/emacs-plugin-jekyll-blog.html">How I wrote an Emacs plugin to build my blog</a> (<a href="https://mastodon.bsd.cafe/@evgandr/116687815479622870">@evgandr@bsd.cafe</a>)</li>
<li><a href="https://thecloudlet.github.io/technical/emacs/org-zola-workflow/">Migrating a Zola blog from Markdown to Org-mode — with a lint/export/check pipeline to keep them in sync | The Cloudlet</a></li>
<li>Org development: <a href="https://git.savannah.gnu.org/cgit/emacs/org-mode.git/commit/etc/ORG-NEWS?id=3ea1682731fa061115bc690e76ce7d1d2955f810">Generate images in TOC for HTML export</a></li>
</ul></li>
<li>Completion:
<ul class="org-ul">
<li><a href="https://www.chiply.dev/post-incremental-suggesting-read">Beyond ICR: Incremental 'Suggesting' Read in Emacs</a> (<a href="https://www.youtube.com/watch?v=UnAavHqekp0">YouTube</a> 20:10, <a href="https://www.reddit.com/r/emacs/comments/1tvjp8l/beyond_icr_incremental_suggesting_read_in_emacs/">Reddit</a>, <a href="https://fosstodon.org/@chiply/116685381663629482">@chiply@fosstodon.org</a>)</li>
</ul></li>
<li>Coding:
<ul class="org-ul">
<li><a href="https://github.com/rschmukler/magit-difftastic">Introducing magit-difftastic: integrate difftastic into magit</a> (<a href="https://www.reddit.com/r/emacs/comments/1twq1bg/introducing_magitdifftastic_integrate_difftastic/">Reddit</a>)</li>
<li><a href="https://github.com/phye/inline-review">inline-review: review merge/pull requests directly within emacs</a> (<a href="https://www.reddit.com/r/emacs/comments/1ttw2qg/inlinereview_review_mergepull_requests_directly/">Reddit</a>)</li>
<li><a href="https://www.alcarney.me/blog/2026/alc-jj-log-view-mode/">Building alc-jj-log-view-mode — Alex Carney</a> (<a href="https://mastodon.social/@alcarney/116711382373829868">@alcarney</a>)</li>
<li><a href="https://wassimans.com/blog/building-ios-apps-with-doom-emacs/">Building IOS Apps With Doom Emacs | Wassim Mansouri</a> (<a href="https://news.ycombinator.com/item?id=48388710">HN</a>)</li>
<li><a href="https://www.youtube.com/watch?v=thPsF9C2b10">CEDET for  Plan 9 coding</a> (01:14)</li>
<li><a href="https://oylenshpeegul.gitlab.io/blog/posts/20260601/">Tim Heaney: Ziglings</a></li>
</ul></li>
<li>Shells:
<ul class="org-ul">
<li><a href="https://www.alcarney.me/blog/2026/eshell-integration/">A Simple jj Integration for eshell — Alex Carney</a> (<a href="https://mastodon.social/@alcarney/116703207672988666">@alcarney</a>)</li>
<li><a href="https://ray-on-emacs.blogspot.com/2026/06/exeln-execute-line.html">Raymond Zeitler: exeln: EXEcute LiNe</a>
<ul class="org-ul">
<li><a href="https://ray-on-emacs.blogspot.com/2026/06/follow-on-to-exeln.html">Follow-on to exeln</a></li>
</ul></li>
</ul></li>
<li>Web:
<ul class="org-ul">
<li><a href="https://irreal.org/blog/?p=13846">Irreal: My Growing Appreciation For EWW</a></li>
</ul></li>
<li>Mail, news, and chat:
<ul class="org-ul">
<li><a href="https://ashishpanigrahi.com/blog/o365-offline-email/">Setting up offline email for Microsoft O365 with notmuch and emacs | Ashish Panigrahi</a> (<a href="https://ioc.exchange/@paniash/116711092886642906">@paniash@ioc.exchange</a>)</li>
<li><a href="https://lars.ingebrigtsen.no/2026/06/05/super-simple-spam-splitting-for-gnus/">Lars Ingebrigtsen: Super Simple Spam Splitting for Gnus</a></li>
<li><a href="https://github.com/emacs-elfeed/elfeed/blob/main/NEWS.org#version-400-2026-06-06">New Elfeed 4.0.0 release</a> (<a href="https://irreal.org/blog/?p=13862">Irreal</a>, <a href="https://news.ycombinator.com/item?id=48428652">HN</a>)</li>
<li><a href="https://en.andros.dev/blog/1a6f3018/chatting-via-meshtastic-in-emacs/">Chatting via Meshtastic in Emacs | Andros Fenollosa</a></li>
</ul></li>
<li>Multimedia:
<ul class="org-ul">
<li><a href="https://mbork.pl/2026-06-06_Copying_images_in_Emacs">Marcin Borkowski: Copying images in Emacs</a></li>
<li><a href="https://www.youtube.com/watch?v=iUrTC4PrBpM">Kokoro-onnx with Cuda for text to speech with Emacs</a> (01:26:56)</li>
</ul></li>
<li>Fun:
<ul class="org-ul">
<li><a href="https://github.com/modeverv/wasmacs">I ported GNU Emacs 30.2 to the browser with WebAssembly</a> (<a href="https://www.reddit.com/r/emacs/comments/1tzy72g/i_ported_gnu_emacs_302_to_the_browser_with/">Reddit</a>)</li>
<li><a href="https://ianyepan.github.io/posts/emacs-in-pop-culture/">Emacs Appearance in Pop Culture</a> (<a href="https://www.reddit.com/r/emacs/comments/1u02d0v/emacs_appearance_in_pop_culture/">Reddit</a>)</li>
</ul></li>
<li>AI:
<ul class="org-ul">
<li><a href="https://kevinlynagh.com/newsletter/2026_05_difftron/">Structural diffing in Emacs; deterministic agent harnesses</a> (<a href="https://github.com/lynaghk/difftron/">GitHub</a>)</li>
<li><a href="https://github.com/ananthakumaran/pi.el">Emacs client for Pi Coding Agent</a> (<a href="https://www.reddit.com/r/emacs/comments/1tz40nr/emacs_client_for_pi_coding_agent/">Reddit</a>)</li>
<li><a href="https://github.com/jaketothepast/codetutor">jaketothepast/codetutor: An AI Pair Programmer, that teaches you to code as you write, for Emacs · GitHub</a> (<a href="https://news.ycombinator.com/item?id=48449430">HN</a>)</li>
</ul></li>
<li>Community:
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/emacs/comments/1tueedh/fortnightly_tips_tricks_and_questions_20260602/">Fortnightly Tips, Tricks, and Questions — 2026-06-02 / week 22</a></li>
<li><a href="https://www.reddit.com/r/emacs/comments/1tudad3/learning_emacs_with_progressive_vision_loss/">Learning Emacs with Progressive Vision Loss</a></li>
<li><a href="https://kelar.org/~bandali/news/fsa-202605.html">Amin Bandali: Free software activities in May 2026</a></li>
<li><a href="https://sachachua.com/blog/2026/06/june-4-emacs-chat-with-ben-zanin-gnomon-mastodon-social/">Emacs Chat 25: Ben Zanin (@gnomon@mastodon.social)</a> (<a href="https://www.youtube.com/watch?v=ax4f5uaOHA8">YouTube</a> 59:30)</li>
<li><a href="https://sachachua.com/blog/2026/05/emacs-carnival-may-2026-may-i-recommend/">Sacha Chua: Emacs Carnival May 2026 wrap-up: "May I recommend&hellip;"</a></li>
<li><a href="https://sachachua.com/blog/2026/06/transcript-of-chat-with-matei-candea-about-emacs-and-ai/">Sacha Chua: Transcript of chat with Matei Candea about Emacs and AI</a></li>
<li><a href="https://www.youtube.com/watch?v=UqashZncNj4">This perfect text editor doesn't exist</a> (15:57)</li>
<li><a href="https://linuxblog.io/teco-neovim-text-editing-unix-linux/">From TECO to Neovim: 50 Years of Text Editing on Unix and Linux</a> (<a href="https://www.reddit.com/r/emacs/comments/1tzo58i/from_teco_to_neovim_50_years_of_text_editing_on/">Reddit</a>)</li>
<li><a href="https://www.swi-prolog.org/PceEmacs.md">PceEmacs is an Emacs written in Prolog instead of Lisp! It also seems to support LSP</a> (<a href="https://www.reddit.com/r/emacs/comments/1tvn264/pceemacs_is_an_emacs_written_in_prolog_instead_of/">Reddit</a>)</li>
</ul></li>
<li><a href="https://rossabaker.com/blog/underappreciated-emacs-built-ins/">Emacs Carnival: Underappreciated Emacs Builtins</a>:
<ul class="org-ul">
<li><a href="https://www.homepages.ucl.ac.uk/~ucecesf/blog/20260602.html">Emacs carnival: rec mode, an all-text database system</a> (<a href="https://fediscience.org/@ericsfraga/116681034174534204">@ericsfraga@fediscience.org</a>)</li>
<li><a href="https://www.cyan.sh/blog/posts/radical-builtins.html">Jakub Nowak: Radical Builtins</a></li>
<li><a href="https://wiki.plexwave.org/emacs-dwim-case-commands">Emacs DWIM case commands</a> by spnw</li>
</ul></li>
<li>Other:
<ul class="org-ul">
<li><a href="https://github.com/ErikPrantare/phony.el">phony.el: Define voice commands in Emacs</a> (<a href="https://www.reddit.com/r/emacs/comments/1tubei6/phonyel_define_voice_commands_in_emacs/">Reddit</a>)</li>
<li><a href="https://bicycleforyourmind.com/much_ado_about_emacs_013">Bicycle for Your Mind: Much Ado About Emacs 013</a> - anddo.el (todos), substitute</li>
<li><a href="https://lars.ingebrigtsen.no/2026/06/03/todo-lists-and-procrastination/">Lars Ingebrigtsen: Todo Lists and Procrastination</a></li>
<li><a href="https://github.com/jamescherti/inhibit-mouse.el">jamescherti/inhibit-mouse.el 1.0.4</a> (<a href="https://www.reddit.com/r/emacs/comments/1tvwk7l/inhibitmouse_disable_the_mouse_in_emacs_release/">Reddit</a>, <a href="https://irreal.org/blog/?p=13853">Irreal</a>)</li>
<li><a href="http://yummymelon.com/devnull/revisiting-emacs-keyboard-macros-with-a-mouse.html">Charles Choi: Revisiting Emacs Keyboard Macros with a Mouse</a></li>
<li><a href="https://sachachua.com/blog/2026/06/emacs-pdf-view-replace-current-page-with-file-using-pdftk/">Sacha Chua: Emacs PDF View: Replace current page with file using PDFtk</a></li>
<li><a href="https://www.yakshaving.co.uk/posts/conquering-the-emacs-daemon/">conquering the Emacs daemon - Blog In Isolation</a> (<a href="https://mastodon.me.uk/@andyc/116697585241088161">@andyc@mastodon.me.uk</a>)</li>
<li><a href="https://github.com/tanrax/emacs-gpu">tanrax/emacs-gpu: GNU Emacs with a GPU-accelerated display backend · GitHub</a> (<a href="https://activity.andros.dev/@andros/statuses/01KT8T7D12K9A22FCZX0NXDV43">@andros@activity.andros.dev</a>)
<ul class="org-ul">
<li><a href="https://yhetil.org/emacs-devel/0CAC2512-C560-4D1C-964B-46BBEF5228BF@subvertising.org/">emacs-devel re: overlap with Canvas patch</a>,<a href="https://yhetil.org/emacs-devel/571c261a-a4fc-4d7f-9ccb-afc6cb530547@gutov.dev/"> can't accept LLM-generated contributions</a></li>
</ul></li>
<li><a href="https://fedora-sysexts.github.io/fedora/emacs/">emacs | extensions.fcos.fr (Fedora)</a> (<a href="https://mastodon.social/@alcarney/116687391476450331">@alcarney</a>) - emacs sysext for Fedora image-based systems</li>
<li><a href="https://github.com/nohzafk/emacs-workspace-hud">I built a floating HUD for Emacs, rendered in Rust egui via WASM</a> (<a href="https://www.reddit.com/r/emacs/comments/1tw7u87/i_built_a_floating_hud_for_emacs_rendered_in_rust/">Reddit</a>) macOS</li>
<li><a href="http://yummymelon.com/devnull/opening-macos-finder-folders-in-emacs-with-scrim.html">Charles Choi: Opening macOS Finder Folders in Emacs with Scrim</a> (<a href="https://sfba.social/@kickingvegas/116678063857985054">@kickingvegas@sfba.social</a>)</li>
<li><a href="https://unixbhaskar.wordpress.com/2026/06/03/damn-emacs-regex-problem/">Damn! Emacs Regex problem | Unixbhaskar's Blog</a> (<a href="https://fosstodon.org/@unixbhaskar/116682966197832720">@unixbhaskar@fosstodon.org</a>)</li>
<li><a href="https://www.youtube.com/watch?v=omoGBS3rzEw">самый хайповый гайд на Emacs</a> (15:40)</li>
</ul></li>
<li>Emacs development:
<ul class="org-ul">
<li>emacs-devel: <a href="https://yhetil.org/emacs-devel/m2mrxes3bs.fsf@gmail.com/">markdown-ts-mode and markdown-ts-view-mode demoted on the release branch</a></li>
<li><a href="https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=1d91d9b717df1781c07d28f46af4ac2af19c16b4">project-vc-dir: Use truenames</a></li>
<li><a href="https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=66e02b3123a2f6845b1ec6e192f3820bb74d4a7b">(Fmarkers_in): New function (bug#81153)</a></li>
<li><a href="https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=2db5a145acbbe84042128806d8b2e333495cf70e">Support Ansible messages in compilation-mode</a></li>
</ul></li>
<li>New packages:
<ul class="org-ul">
<li><a target="_blank" href="https://melpa.org/#/bluesky">bluesky</a>: A Bluesky client (MELPA)</li>
<li><a target="_blank" href="https://melpa.org/#/cui">cui</a>: AI-LLM chat blocks for org-mode (MELPA)</li>
<li><a target="_blank" href="https://melpa.org/#/desert-theme">desert-theme</a>: A warm earthy port of Vim's desert theme (MELPA)</li>
<li><a target="_blank" href="https://elpa.nongnu.org/nongnu/flamegraph.html">flamegraph</a>: Flame graphs for Emacs's native profiler and folded stacks files (NonGNU ELPA)</li>
<li><a target="_blank" href="https://melpa.org/#/sleek-modeline">sleek-modeline</a>: Minimal and elegant modeline (MELPA)</li>
</ul></li>
</ul>

<p>
Links from <a href="https://www.reddit.com/r/emacs">reddit.com/r/emacs</a>, <a href="https://www.reddit.com/r/orgmode">r/orgmode</a>, <a href="https://www.reddit.com/r/spacemacs">r/spacemacs</a>, <a href="https://mastodon.social/tags/emacs">Mastodon #emacs</a>, <a href="https://bsky.app/hashtag/emacs">Bluesky #emacs</a>, <a href="https://hn.algolia.com/?query=emacs&amp;sort=byDate&amp;prefix&amp;page=0&amp;dateRange=all&amp;type=story">Hacker News</a>, <a href="https://lobste.rs/search?q=emacs&amp;what=stories&amp;order=newest">lobste.rs</a>, <a href="https://programming.dev/c/emacs?dataType=Post&amp;page=1&amp;sort=New">programming.dev</a>, <a href="https://lemmy.world/c/emacs">lemmy.world</a>, <a href="https://lemmy.ml/c/emacs?dataType=Post&amp;page=1&amp;sort=New">lemmy.ml</a>, <a href="https://planet.emacslife.com">planet.emacslife.com</a>, <a href="https://www.youtube.com/playlist?list=PL4th0AZixyREOtvxDpdxC9oMuX7Ar7Sdt">YouTube</a>, <a href="http://git.savannah.gnu.org/cgit/emacs.git/log/etc/NEWS">the Emacs NEWS file</a>, <a href="https://emacslife.com/calendar/">Emacs Calendar</a>, and <a href="https://lists.gnu.org/archive/html/emacs-devel/2026-06">emacs-devel</a>. Thanks to Andrés Ramírez for emacs-devel links. Do you have an Emacs-related link or announcement? Please e-mail me at <a href="mailto:sacha@sachachua.com">sacha@sachachua.com</a>. Thank you!
</p>
</div>
<div id="postamble" class="status">

       <div class="back-to-top">
       <a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a>
       </div>

       <script type="text/javascript">
           var offset = 220;
           var duration = 500;
           jQuery(window).scroll(function() {
               if (jQuery(this).scrollTop() > offset) {
                   jQuery('.back-to-top').fadeIn(duration);
               } else {
                   jQuery('.back-to-top').fadeOut(duration);
               }
           });
       </script>
       <script src="https://sachachua.com/assets/js/misc.js"></script>
</div>
</body>
</html>